Revit 2024 API
Transform1D.Assign Method
 Assigns values from the input transformation to this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public void Assign(
	Transform1D from
)
Visual Basic
Public Sub Assign ( _
	from As Transform1D _
)
Visual C++
public:
void Assign(
	Transform1D^ from
)
Parameters
from
Type: Autodesk.Revit.DB.Transform1D
 The transformation to use as input.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Transform1D Class
Autodesk.Revit.DB Namespace